Revit 2026 API

# MassSurfaceDataMassLevelDataId Property

---

The MassLevelData used when the surface is horizontal, planar, and at the same height as a MassLevelData related to the same mass as the referenced face.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId MassLevelDataId { get; }
```
```vb
Public ReadOnly Property MassLevelDataId As ElementId
	Get
```
```cpp
public:
property ElementId^ MassLevelDataId {
	ElementId^ get ();
}
```
```fsharp
member MassLevelDataId : ElementId with get
```

#### Property Value

ElementId

#### Reference

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace